package chapter11;
// == 자바 컬렉션 프레임워크 ==
// : 데이터를 저장학 처리하는 자료구조의 표준화 된 설계

// 컬렉션 프레임워크의 주요 인터페이스
// 1. Collection
// >> 자바 컬렉션 프레임워크의 상위 인터페이스, 데이터의 집합을 다룸

// 2. List
// : 데이터의 순서를 유지시키고 중복을 허용한다. (ArrayList, LinkedList 등)

//3. Set
// : 데이터의 순서를 유지하지 않고 중복을 허용하지 않는다. (HashSet, TreeSet 등)

// 4. Map
// : 키-값 쌍으로 이루어진 데이터를 다룸, 키 중복 허용 하지 않는다. 값은 중복 허용한다.
// (HashMap, TreeMap)
public class A_Collection {
	// 컬렉션 프레임워크 사용방법
	// 1. 데이터의 특성에 맞는 글래스 선택
	//2. 키 - 값 쌍 데이터의 필요성
	// 3. 데이터의 중복에 대한 필요서, 순서 유지에 대한 필요성 점검
	
	
}
